# 1. Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
# В расчете необходимо использовать формулу: (выработка в часах*ставка в час) + премия.
# Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.

from sys import argv
from Less_4 import p4_1

file, productivity, rate, bonus = argv

print(p4_1.salary(int(productivity), int(rate), int(bonus)))
